Revit 2027 API
BuiltInFailures.KeyBasedTreeFileFailures Class
 Failures occurred when reading key based tree text file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeFileFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class KeyBasedTreeFileFailures
Public NotInheritable Class KeyBasedTreeFileFailures
public ref class KeyBasedTreeFileFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type KeyBasedTreeFileFailures = class end
The BuiltInFailures.KeyBasedTreeFileFailures type exposes the following members.
Properties
Name | Description
CannotOpenFileForRead |  Cannot open file [FileName].
CannotUnderstandAtLine |  Cannot understand [EntryType] line '[Number]'
Top
See Also
Reference
Autodesk.Revit.DB Namespace